Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObjectAttributeEnumerator Class
 The ReferenceModelObjectAttributeEnumerator class can be used to enumerate through reference model object attributes.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttributeEnumerator
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ReferenceModelObjectAttributeEnumerator : IEnumerator
<SerializableAttribute>
Public NotInheritable Class ReferenceModelObjectAttributeEnumerator
	Implements IEnumerator
The ReferenceModelObjectAttributeEnumerator type exposes the following members.
Constructors
Name | Description
ReferenceModelObjectAttributeEnumerator
 Creates a new reference model object attribute enumerator instance.
Top
Properties
Name | Description
Current
 The current attribute.
Top
Methods
Name | Description
MoveNext
 Moves to the next reference model object attribute.
Reset
 Resets the enumerator.
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Model.Collaboration;
using System;
public class Example
{
       public void Example1()
       {
           ReferenceModel RM = new ReferenceModel();
           RM.Filename = "c:\\TeklaStructuresModels\\reference_model.dwg";
           RM.Scale = 1.0;
           if(RM.Insert())
           {
               foreach(ReferenceModelObject RMO in RM.GetChildren())
               {
                   ReferenceModelObjectAttributeEnumerator RMOAttributeEnumerator = new ReferenceModelObjectAttributeEnumerator(RMO);
                   while(RMOAttributeEnumerator.MoveNext())
                   {
                       ReferenceModelObjectAttribute RMOAttribute = (ReferenceModelObjectAttribute)RMOAttributeEnumerator.Current;
                       Console.WriteLine("Attribute name: " + RMOAttribute.Name);
                   }
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Model.Collaboration Namespace